# Install command-line tools using Homebrew
# Usage: `brew bundle`

# mac app store
brew 'mas'
mas 'Xcode', id: 497799835
mas 'WireGuard', id: 1451685025
mas 'OneDrive', id: 823766827
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Powerpoint', id: 462062816

# replace default openssl
brew 'openssl'

# transparent proxy meets VPN meets ssh
brew 'sshuttle'
brew 'wireguard-tools'

# shell
brew 'zsh'
brew 'zsh-completions'

# terminal
cask 'iterm2'

# git
brew 'git'
brew 'git-extras'
cask 'gitup'
brew 'git-crypt'
cask 'keybase'

## development languages
# ruby with version manager
brew 'chruby'
brew 'ruby-install'
# node
brew 'node'
brew 'yarn'
# other
brew 'python'
brew 'python@2'
cask 'java'
brew 'go'
brew 'scala'
brew 'elixir'

# database client tools and libs
brew 'postgresql'
brew 'redis'
brew 'rabbitmq'
brew 'memcached'

# utils
brew 'coreutils'
brew 'ripgrep'
brew 'fasd'
brew 'fzf'
brew 'wget'
#brew 'curl'
brew 'ccat'
brew 'awscli'
brew 'terminal-notifier'
brew 'forego'
brew 'jq'

# heroku
tap 'heroku/brew'
brew 'heroku'

# editor
brew 'macvim'

# development font
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'

# browsers
tap 'homebrew/cask-versions'
cask 'google-chrome-dev'
cask 'opera'
cask 'opera-developer'
cask 'firefox'
cask 'firefox-developer-edition'

# apps
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'atom'
cask 'calibre'
cask 'flux'
cask 'skype'
cask 'spotify'
cask 'transmission-remote-gui'
#cask 'truecrypt71a' #No available Cask for truecrypt71a - http://apple.stackexchange.com/questions/173879/truecrypt-7-1a-requires-mac-os-x-10-4-or-later-on-yosemite-10-10
cask 'cyberduck'
cask 'android-file-transfer'
#cask 'gimp'
#cask 'steam'
#cask 'ngrok'
cask 'vanilla'

# drives
cask 'dropbox'
#cask 'google-drive-file-stream'
#cask 'amazon-photos'

# docker for mac
cask 'docker'
