# Install command-line tools using Homebrew
# Usage: `brew bundle`

# brew cask for apps
tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'brew-cask'

# shell
brew 'zsh'

# terminal
cask 'iterm2'

# git
brew 'git'
brew 'git-extras'
brew 'legit'
cask 'gitx-l'

# ruby version manager
brew 'rbenv'
brew 'ruby-build'

# other development languages
brew 'node'
brew 'python'
cask 'java'
brew 'go'
brew 'scala'

# databases
brew 'postgresql', args: ['no-python']
brew 'redis'
brew 'rabbitmq'
brew 'memcached'

# replace default openssl
brew 'openssl'

# utils
brew 'coreutils'
brew 'ack'
brew 'the_silver_searcher'
brew 'fasd'
brew 'wget'
brew 'curl'
brew 'ccat'

brew 'ngrok'
brew 'awscli'
brew 'terminal-notifier'
brew 'forego'

# editor
brew 'vim', args: ['override-system-vi']
brew 'macvim'

# development font
tap 'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'

# browsers
cask 'google-chrome-dev'
cask 'opera'
cask 'firefox'
cask 'lastpass'

# apps
cask 'virtualbox'
cask 'vmware-fusion'
cask 'rdm'
cask 'vlc'
cask 'adium'
cask 'atom'
cask 'calibre'
cask 'crashplan'
cask 'flux'
cask 'skitch'
cask 'skype'
cask 'spotify'
cask 'tinyumbrella'
cask 'transmission-remote-gui'
cask 'truecrypt71a'
cask 'cyberduck'

# drives
cask 'dropbox'
cask 'google-drive'
#cask 'skydrive' #onedrive

# docker
brew 'boot2docker'
