# Install command-line tools using Homebrew
# Usage: `brew bundle`

# brew cask for apps
tap 'caskroom/cask'
tap 'caskroom/versions'

# mac app store
brew 'mas'
mas 'XCode', id: 497799835
mas 'OneDrive', id: 823766827

# replace default openssl
brew 'openssl'

# transparent proxy meets VPN meets ssh
brew 'sshuttle'

# shell
brew 'zsh'
brew 'zsh-completions'

# terminal
cask 'iterm2'

# git
brew 'git', args: ['without-completions']
brew 'git-extras'
cask 'rowanj-gitx'
cask 'gitup'

## development languages
# ruby with version manager
brew 'chruby'
brew 'ruby-install'
# node
brew 'node'
brew 'yarn'
# other
brew 'python'
cask 'java'
brew 'go'
brew 'scala'
brew 'elixir'

# database client tools and libs
brew 'postgresql', args: ['no-python']
brew 'redis'
brew 'rabbitmq'
brew 'memcached'

# utils
brew 'coreutils'
brew 'ripgrep'
brew 'fasd'
brew 'wget'
brew 'curl', args: ['with-nghttp2']
brew 'ccat'
brew 'awscli'
brew 'terminal-notifier'
brew 'forego'

# heroku
brew 'heroku'

# editor
brew 'vim', args: ['with-override-system-vi']
brew 'macvim'

# development font
tap 'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'

# browsers
cask 'google-chrome-dev'
cask 'opera'
cask 'opera-developer'
cask 'firefox'
cask 'firefoxdeveloperedition'

# apps
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'rdm'
cask 'vlc'
cask 'atom'
cask 'calibre'
cask 'crashplan'
cask 'flux'
cask 'skype'
cask 'spotify'
cask 'transmission-remote-gui'
#cask 'truecrypt71a' #No available Cask for truecrypt71a - http://apple.stackexchange.com/questions/173879/truecrypt-7-1a-requires-mac-os-x-10-4-or-later-on-yosemite-10-10
cask 'cyberduck'
cask 'android-file-transfer'
#cask 'gimp'
#cask 'microsoft-office365'
#cask 'steam'
cask 'ngrok'
cask 'vanilla'

# drives
cask 'dropbox'
cask 'google-drive'
cask 'amazon-drive'

# docker for mac
cask 'docker'
